# ExportLinetypeTable Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLinetypeTable Methods
ExportLinetypeTable Class See Also
---
The ExportLinetypeTable type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Add | Inserts a (key, info) pair into Export line type table. |
| Clear | Removes all contents stored in Export line type table. |
| ContainsKey | Checks whether a pattern key exists in the table. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetEnumerator | Returns an enumerator that iterates through a collection. |
| GetExportLinetypeInfo | Gets a copy of the ExportLinetypeInfo corresponding to the given ExportLinetypeKey. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetKeys | Gets all the keys stored in the map. |
| GetLinetypeTableIterator | Returns a ExportLinetypeTableIterator that iterates through the collection. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetValues | Returns all the values stored in the map. |
| Remove | Removes the pair (key, info) corresponding to the given ExportLinetypeKey. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace